//=============================================================================
/*! 
    @addtogroup 
    @file       UBW.h
    @brief      UBWオブジェクト
    
    UBWクラスの定義
    
    @attention  -
    @note       -
    @author     matui
    @date       2012/2/3
    @version    1.0.0
    @par        Copyright
    Copyright (c) 2011 Valfirle Developer. All Rights Reserved.
===============================================================================
    @par        History
    - 2012/2/3 matsui
      -# 作成
*/
//=============================================================================


//Include Guard
#ifndef __INCLUDE_UBW_H__
#define __INCLUDE_UBW_H__


/*! @par include */
#include "./../GameObject.h"


/*! @par global */


/*! @class Ladder */
class UBW : public GameObject
{
private:
	
	u32 mFlameCnt;
	bool m_bStart;
	u32	mUBW;
public:
	//---------------------------------------------------------------------------
	/*! @brief メンバゲッター */
	//---------------------------------------------------------------------------
	virtual ObjectType getObjType() const { return OBJ_UBW; }

	//---------------------------------------------------------------------------
	/*! @brief メンバセッター */
	//---------------------------------------------------------------------------

	//---------------------------------------------------------------------------
	/*! 
		@brief UBW::UBW

		デフォルトコンストラクタ

		@param[in]      void
		@return         none
		@exception      none
	*/
	//---------------------------------------------------------------------------
	UBW();

	//---------------------------------------------------------------------------
	/*! 
		@brief UBW::~UBW

		デストラクタ

		@param[in]      none
		@return         none
		@exception      none
	*/
	//---------------------------------------------------------------------------
	~UBW();

	//---------------------------------------------------------------------------
	/*! 
		@brief UBW::Initialize

		初期化処理

		@param[in]      void
		@return         bool
		- true  成功
		- false 失敗
		@exception      none
	*/
	//---------------------------------------------------------------------------
	bool Initialize();

	//---------------------------------------------------------------------------
	/*! 
		@brief UBW::Release

		終了処理

		@param[in]      void
		@return         bool
		- true  成功
		- false 失敗
		@exception      none
	*/
	//---------------------------------------------------------------------------
	bool Release();

	//---------------------------------------------------------------------------
	/*! 
		@brief UBW::Update

		フレーム更新処理

		@param[in]      void
		@return         bool
		@exception      none
	*/
	//---------------------------------------------------------------------------
	bool Update();

	//---------------------------------------------------------------------------
	/*! 
		@brief UBW::HandleEvent

		イベント処理

		@param[in]      EventType event_ イベントタイプ
		@param[in]      void      *args_ データ(適当にキャストする)
		@return         void
		@exception      none
	*/
	//---------------------------------------------------------------------------
	int HandleEvent(u32 event_,void *args_);

};


//End of Include Guard
#endif


//=============================================================================
//								End of File
//=============================================================================