//=============================================================================
//【 SceneConnection 】
//-----------------------------------------------------------------------------
///**
//  @file       SceneConnection.h
//  @brief      SceneConnection
//  @author     yama
//*/
//=============================================================================

#pragma once

//=============================================================================
// ■ SceneConnection クラス
//-----------------------------------------------------------------------------
///**
//  @brief		ネット接続画面
//
//  @par
//              この画面では、接続方法 (親か子か) を選択し、
//              それに合わせて GameManager を初期化する。基本的にそれだけ。
//              この場合は IP アドレスを入力する。
//*/
//=============================================================================
class SceneConnection : public LGameScene
{
public:

    /// シーン名
    virtual const char* getSceneName() { return "SceneConnection"; }

	/// 開始処理
	virtual void onStart();

    /// フレーム更新
	virtual void onUpdate();

    /// 終了処理
	virtual void onTerminate();

};

//=============================================================================
//								end of file
//=============================================================================