//=============================================================================
//【 SceneConnection 】
//=============================================================================

#include "stdafx.h"
#include "../Game/GameManager.h"
#include "SceneTitle.h"
#include "SceneNetRoom.h"
#include "SceneConnection.h"

//=============================================================================
// ■ SceneConnection クラス
//=============================================================================


//---------------------------------------------------------------------
// ● 開始処理
//---------------------------------------------------------------------
void SceneConnection::onStart()
{
    printf( "-------------------------------------------------\n" );
    printf( " ▼ 接続画面\n" );
    printf( "-------------------------------------------------\n" );
    printf( "Z > 部屋を作る\n" );
    printf( "X > 部屋に入る\n" );
}

//---------------------------------------------------------------------
// ● フレーム更新
//---------------------------------------------------------------------
void SceneConnection::onUpdate()
{
    // 部屋を作る
    if ( Input.isOnTrigger( LN_BUTTON_A ) )
    {
        // 親として初期化し、部屋画面に移動
        GameManager::getInstance()->initializeParent();
        LGameScene::changeScene( "SceneNetRoom" );
        return;
    }

    // 部屋に入る
    if ( Input.isOnTrigger( LN_BUTTON_B ) )
    {

        char addr[ 64 ];
        printf( "IP アドレス入力\n>" );
        scanf( "%s", addr );

        printf( "接続...\n" );

        // 子として初期化
        GameManager::getInstance()->initializeChild( addr );

        // 接続が完了した場合に移動するようにしておく
        LGameScene::changeScene( NEW SceneNetRoom() );

        return;
    }
}

//---------------------------------------------------------------------
// ● 終了処理
//---------------------------------------------------------------------
void SceneConnection::onTerminate()
{
}

//=============================================================================
//								end of file
//=============================================================================