//=============================================================================
//【 SceneNetRoom 】
//-----------------------------------------------------------------------------
///**
//  @file       SceneNetRoom.h
//  @brief      SceneNetRoom
//  @author     yama
//*/
//=============================================================================

#pragma once

#include "../Game/GameSession.h"

//=============================================================================
// ■ SceneNetRoom クラス
//-----------------------------------------------------------------------------
///**
//  @brief		ネットゲーム時の、ルームのシーン
//
//  @par
//              Restor のころは全部 SceneConnection にまとめてたけど、
//              それだとゲームクリア・ゲームオーバーから接続画面に戻った時に
//              また全部接続をやり直さないといけなくなる。
//              そのため、実際の接続とゲーム開始合図を分離させてみた。
//              ゲームクリア・ゲームオーバーでゲームを終了したときは
//              このシーンに戻るようにする。
//*/
//=============================================================================
class SceneNetRoom
    : public LGameScene
    , public GameSession::EventListener
{
public:

    /// シーン名
    virtual const char* getSceneName() { return "SceneNetRoom"; }

	/// 開始処理
	virtual void onStart();

    /// フレーム更新
	virtual void onUpdate();

    /// 終了処理
	virtual void onTerminate();

    /// イベント処理コールバック
    virtual int HandleEvent( u32 event_, void* args_ );

};

//=============================================================================
//								end of file
//=============================================================================