//=============================================================================
//【 LFramework 】
//-----------------------------------------------------------------------------
///**
//  @file       LFramework.h
//  @brief      LFramework
//  @version    1.0
//  @date       2010/09/10
//*/
//=============================================================================

#pragma once
#include "LGameScene.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{

//=============================================================================
// ■ LFramework クラス
//-----------------------------------------------------------------------------
///**
//  @brief      ライブラリ全体の動作を管理するクラス
//
//  @par
//              このクラスのインスタンスには、
//              グローバル変数 LNote::Accessor::Framework によってもアクセスできます。
//*/
//=============================================================================
class LFramework
{
public:

    //---------------------------------------------------------------------
    ///**
    //  @brief      フレーム更新回数の取得
    //*/
	//---------------------------------------------------------------------
    //u32 getFrameCount() const;


    //---------------------------------------------------------------------
    ///**
    //  @brief      update() で行う処理を指定する
    //
    //  @param[in]  flags_ : LNAutoUpdateFlags のフラグの組み合わせ
    //
    //  @par
    //              LN_AUTOUPDATE_SYSTEM を指定しなかった場合、
    //              Framework はアプリケーションに終了要求(ウィンドウの×ボタンがクリックされた等)
    //              が来ているかを判定できなくなります。<br>
    //              この場合 update() は常に true を返します。<br>
    //              <br>
    //              LN_AUTOUPDATE_SYSTEM    : メッセージ処理とフレーム待ち処理を行う (常に ON を推奨)<br>
	//              LN_AUTOUPDATE_INPUT     : 入力機能の更新を行う<br>
	//              LN_AUTOUPDATE_AUDIO     : 音声機能の更新を行う<br>
	//              LN_AUTOUPDATE_SCENE     : ゲーム画面の描画を行う<br>
    //*/
	//---------------------------------------------------------------------
    //void setAutoUpdateFlags( u32 flags_ );

    //---------------------------------------------------------------------	
    ///**
    //  @brief      フレーム更新
    //
    //  @par
    //              ライブラリ全体を 1 フレーム分更新します。
    //              通常、1 フレームに 1 度だけ呼び出します。<br>
    //
    //  @attention
    //              run() によってゲームシーンを実行している場合、更新処理は
    //              LGameScene クラスの内部で行われます。
    //              その場合は不具合防止のため、この関数は何も行わずに常に
    //              true を返すようになります。
    //*/
	//---------------------------------------------------------------------
	static bool update();

    //---------------------------------------------------------------------
    ///**
    //  @brief      ゲームシーンを与えて実行開始
    //
    //  @par
    //              この関数は、アプリケーションに終了要求が来る(ウィンドウの
    //              クローズボタンが押される等)か、exit() が呼ばれるまで
    //              終了せず、内部でゲームのメインループを実行し続けます。<br>
    //              <br>
    //              この関数で実行を開始した場合、以降の更新処理は LGameScene
    //              クラスの内部で行われます。そのため、update() を呼び出す必要は
    //              ありません。
    //*/
	//---------------------------------------------------------------------
	static void run( LGameScene* scene_ );

    

};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace LNote

//=============================================================================
//                              end of file
//=============================================================================