//=============================================================================
/*! 
    @addtogroup 
    @file       Convert.h
    @brief      変換系関数群
    
    変数変換操作系の関数を内包している
    
    @attention  -
    @note       -
    @author     Hi-ra Mizuno
    @date       2011/06/23
    @version    1.0.0
    @par        Copyright
    Copyright (c) 2011 Hi-ra Mizuno. All Rights Reserved.
===============================================================================
    @par        History
    - 2011/06/23 Hi-ra Mizuno
      -# 作成
    - 2011/06/28
      -# ファイル名をJZStringからConvertに変更
    - 2011/08/25
      -# モノステートスタイルに変更
*/
//=============================================================================


//Include Guard
#ifndef __INCLUDE_CONVERT_H__
#define __INCLUDE_CONVERT_H__


/*! @class Convert
	@brief Convertクラス

	変換系関数群
*/
class Convert
{
public:
	/*! @par publicメンバ変数 */

private:
	/*! @par privateメンバ変数 */


public:
	/*! @par 例外処理 */


private:
	/*! @par コンストラクタ・デストラクタ */
	//---------------------------------------------------------------------------
	/*! 
		@brief Convert::Convert
	
	    デフォルトコンストラクタ
	
		@param[in]      void
	    @return         none
	    @exception      none
	*/
	//---------------------------------------------------------------------------
	Convert();

	//---------------------------------------------------------------------------
	/*! 
		@brief Convert::~Convert
	
	    デストラクタ
	
		@param[in]      void
	    @return         none
	    @exception      none
	*/
	//---------------------------------------------------------------------------
	~Convert();

public:
	/*! @par publicメンバ関数 */
	//---------------------------------------------------------------------------
	/*! @brief メンバゲッター */
	//---------------------------------------------------------------------------

	//---------------------------------------------------------------------------
	/*! @brief メンバセッター */
	//---------------------------------------------------------------------------

	//---------------------------------------------------------------------------
	/*! 
		@brief Convert::StrAtoW

		char型からwchar_t型に変換する

		@param[in]      const char *c_pszStr_ :変換対象文字列
		@return         wchar_t*
		- 変換後文字列
		@exception      none
	*/
	//---------------------------------------------------------------------------
	static wchar_t* StrAtoW(const char *c_pszStr_);

	//---------------------------------------------------------------------------
	/*! 
		@brief Convert::StrWtoA

		wchar_t型からchar型に変換する

		@param[in]      const wchar_t *c_pwszStr_ :変換対象文字列
		@return         char*
		- 変換後文字列
		@exception      none
	*/
	//---------------------------------------------------------------------------
	static char* StrWtoA(const wchar_t *c_pwszStr_);

private:
	/*! @par privateメンバ関数 */

};


//End of Include Guard
#endif


//=============================================================================
//								End of File
//=============================================================================